src/cf/src/DataProcessors/РаспределениеЗатраченногоВремени/РаспределениеЗатраченногоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РаспределениеЗатраченногоВремени</name>
</mdclass:DataProcessor>

src/cf/src/InformationRegisters/УчетРабочегоВремени/УчетРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетРабочегоВремени</name>
  <resources>
    <name>Затрачено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <comment>АПК:1208 Считаем корректным имя в Купорос</comment>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>День</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРаботы</name>
    <type>
      <types>EnumRef.ТипыРаботПоЗадачам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШаблонПлановыхЗатрат</name>
    <type>
      <types>CatalogRef.ШаблоныПлановыхТрудозатрат</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ПланРабочегоВремениПоДням/ПланРабочегоВремениПоДням.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПланРабочегоВремениПоДням</name>
  <resources>
    <name>Выделено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>День</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Enums/ТипыЗадач/ТипыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗадач</name>
  <enumValues>
    <name>Разработка</name>
  </enumValues>
  <enumValues>
    <name>Сопровождение</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольнаяЗадача</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/ТипыРаботПоЗадачам/ТипыРаботПоЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРаботПоЗадачам</name>
  <enumValues>
    <name>ФормированиеТехническогоРешения</name>
  </enumValues>
  <enumValues>
    <name>Разработка</name>
  </enumValues>
  <enumValues>
    <name>Документирование</name>
  </enumValues>
  <enumValues>
    <name>БизнесТестирование</name>
  </enumValues>
  <enumValues>
    <name>ПереносИзмененийВПродуктивнуюСистему</name>
  </enumValues>
  <enumValues>
    <name>Сопровождение</name>
  </enumValues>
  <enumValues>
    <name>Совещание</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/ШаблоныПлановыхТрудозатрат/ШаблоныПлановыхТрудозатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныПлановыхТрудозатрат</name>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Включен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗадачаПользователя</name>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРедактирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДниНедели</name>
    <attributes>
      <name>Повторять</name>
      <type>
        <types>EnumRef.ПовторятьНедель</types>
      </type>
    </attributes>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипРаботы</name>
      <type>
        <types>EnumRef.ТипыРаботПоЗадачам</types>
      </type>
    </attributes>
    <attributes>
      <name>Трудозатраты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/DataProcessors/РаспределениеЗатраченногоВремени/Forms/РедактированиеТрудозатрат/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "Исполнитель, Задача, День");
	
	ЗаполнитьИсториюПоследних();
	
	ЭтаЗадачаВыполнена = Задача.Выполнена;
	
	Если ЗначениеЗаполнено(День) Тогда
		
		НаборЗаписей = ПланированиеЗадачСервер.НаборЗаписейПоРегистру(Исполнитель, Задача, День);
		НаборЗаписей.Прочитать();
		УчетРабочегоВремени.Загрузить(НаборЗаписей.Выгрузить());
		
		СписокДней.Добавить(День);
		
		Элементы.ПояснениеРаспределениеПоДням.Заголовок = "";
		Элементы.ПогрешностьВМинутах.ТолькоПросмотр = Истина;
		Элементы.БезКонтроляОстаткаПоДню.Видимость = Ложь;
		
	Иначе
		
		СписокДней.ЗагрузитьЗначения(Параметры.СписокДней.ВыгрузитьЗначения());
		Заголовок = НСтр("ru = 'Распределение трудозатрат по дням'");
		ЭтоРаспределениеПоДням = Истина;
		Элементы.БезКонтроляОстаткаПоДню.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтаЗадачаВыполнена Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Выбранная задача уже выполнена.'"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУчетРабочегоВремени

&НаКлиенте
Процедура УчетРабочегоВремениПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.УчетРабочегоВремени.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Копирование Тогда
		
		ТекущиеДанные.ШаблонПлановыхЗатрат = "";
		
	ИначеЕсли НоваяСтрока Тогда
	
		ТекущиеДанные.ТипРаботы = ТипРаботыПоЗадаче(Задача);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УчетРабочегоВремениВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.УчетРабочегоВремениШаблонПлановыхЗатрат Тогда
		
		ПоказатьЗначение(, Элемент.ТекущиеДанные.ШаблонПлановыхЗатрат);
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	
	ИтогиПоДням = СохранитьИзмененияНаСервере();
	Закрыть(ИтогиПоДням);
	
КонецПроцедуры

&НаСервере
Функция СохранитьИзмененияНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетРабочегоВремени.Затрачено КАК ЗатраченоВсего,
	|	ВЫБОР
	|		КОГДА УчетРабочегоВремени.Задача = &Задача
	|			ТОГДА УчетРабочегоВремени.Затрачено
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЗатраченоПоЗадаче
	|ИЗ
	|	РегистрСведений.УчетРабочегоВремени КАК УчетРабочегоВремени
	|ГДЕ
	|	УчетРабочегоВремени.Исполнитель = &Исполнитель
	|	И УчетРабочегоВремени.День = &День
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланРабочегоВремениПоДням.Выделено КАК Выделено
	|ИЗ
	|	РегистрСведений.ПланРабочегоВремениПоДням КАК ПланРабочегоВремениПоДням
	|ГДЕ
	|	ПланРабочегоВремениПоДням.Исполнитель = &Исполнитель
	|	И ПланРабочегоВремениПоДням.День = &День";
	
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	Запрос.УстановитьПараметр("Задача", Задача);
	
	ГенераторСлучайныхЧисел = Новый ГенераторСлучайныхЧисел;
	ИтогиПоДням = Новый Соответствие;
	
	НачатьТранзакцию();
	Попытка
				
		Для каждого ЭлементСписка Из СписокДней Цикл
			
			УстановитьТрудозатратыЗаДень(ЭлементСписка, Запрос, ГенераторСлучайныхЧисел, ИтогиПоДням);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
			
	Возврат ИтогиПоДням;
	
КонецФункции

&НаСервере
Процедура УстановитьТрудозатратыЗаДень(ЭлементСписка, Запрос, ГенераторСлучайныхЧисел, ИтогиПоДням)
	
	ТрудозатратыЗаДень = ТрудозатратыЗаДень(ЭлементСписка, Запрос, ГенераторСлучайныхЧисел);
	
	Если ТрудозатратыЗаДень = Неопределено Тогда
		
		ИтогиПоДням.Вставить(ЭлементСписка.Значение, 0);
		Возврат;
		
	Иначе
		
		ИтогиПоДням.Вставить(ЭлементСписка.Значение, ТрудозатратыЗаДень.Итог("Затрачено"));
		
	КонецЕсли;
	
	ДеньТрудозатрат = ЭлементСписка.Значение;
	
	ПланированиеЗадачСервер.ФиксацияТрудозатратЗаДень(Исполнитель, Задача, ДеньТрудозатрат, ТрудозатратыЗаДень);
	
КонецПроцедуры

&НаСервере
Функция ТрудозатратыЗаДень(ЭлементСписка, Запрос, ГенераторСлучайныхЧисел)
	
	ТрудозатратыЗаДень = УчетРабочегоВремени.Выгрузить();
	
	Если Не ЭтоРаспределениеПоДням Тогда
		
		Возврат ТрудозатратыЗаДень;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("День", ЭлементСписка.Значение);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выгрузка = РезультатЗапроса[0].Выгрузить();
	ЗатраченоДругимиЗадачами = Выгрузка.Итог("ЗатраченоВсего") - Выгрузка.Итог("ЗатраченоПоЗадаче");
	
	Выборка = РезультатЗапроса[1].Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ВыделеноНаДень = Выборка.Выделено;
		
	Иначе
		
		ВыделеноНаДень = 0;
		
	КонецЕсли;
	
	Если Не БезКонтроляОстаткаПоДню Тогда
		
		ОстатокНаДень = ВыделеноНаДень - ЗатраченоДругимиЗадачами;
		
		Если ОстатокНаДень < (ПогрешностьВМинутах / 60) Тогда
			
			Возврат Неопределено;
			
		КонецЕсли;
		
		УказаноЧасов = ТрудозатратыЗаДень.Итог("Затрачено");
		
		Если УказаноЧасов > ОстатокНаДень Тогда
			
			ДоляРаспределения = ОстатокНаДень / УказаноЧасов;
			
			Для каждого СтрокаТаблицы Из ТрудозатратыЗаДень Цикл
				
				СтрокаТаблицы.Затрачено = СтрокаТаблицы.Затрачено * ДоляРаспределения;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;  // Не БезКонтроляОстаткаПоДню
	
	Для каждого СтрокаТаблицы Из ТрудозатратыЗаДень Цикл
		
		Отклонение = ГенераторСлучайныхЧисел.СлучайноеЧисло(, ПогрешностьВМинутах * 2);
		Отклонение = (Отклонение - ПогрешностьВМинутах) / 60;
		СтрокаТаблицы.Затрачено = СтрокаТаблицы.Затрачено + Отклонение;
		
	КонецЦикла;
	
	Возврат ТрудозатратыЗаДень;
	
КонецФункции

&НаСервере
Функция НаборЗаписейПоРегистру(ОтборДень)
	
	НаборЗаписей = РегистрыСведений.УчетРабочегоВремени.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Исполнитель.Установить(Исполнитель);
	НаборЗаписей.Отбор.Задача.Установить(Задача);
	НаборЗаписей.Отбор.День.Установить(ОтборДень);
	
	Возврат НаборЗаписей;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТипРаботыПоЗадаче(ЗадачаСсылка)

	ТипЗадачи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗадачаСсылка, "ТипЗадачи");
	
	Если ТипЗадачи = Перечисления.ТипыЗадач.Сопровождение Тогда
	
		Результат = Перечисления.ТипыРаботПоЗадачам.Сопровождение;
		
	ИначеЕсли ТипЗадачи = Перечисления.ТипыЗадач.Разработка Тогда	
		
		Результат = Перечисления.ТипыРаботПоЗадачам.Разработка;
		
	Иначе
		
		Результат = Перечисления.ТипыРаботПоЗадачам.ПустаяСсылка();
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура ДекорацияВставитьИзИсторииНажатие(Элемент)
	
	СписокИсторииПоследних = Новый СписокЗначений;
	
	Для каждого ТекСтрока Из ИсторияПоследних Цикл
		
		ДанныеПоИстории = Новый Структура;
		ДанныеПоИстории.Вставить("ТипРаботы", ТекСтрока.ТипРаботы);
		ДанныеПоИстории.Вставить("Комментарий", ТекСтрока.Комментарий);
		ДанныеПоИстории.Вставить("Затрачено", ТекСтрока.Затрачено);
		
		СписокИсторииПоследних.Добавить(ДанныеПоИстории, ТекСтрока.Представление);
	
	КонецЦикла;

	Оповещение = Новый ОписаниеОповещения("ПослеВыбораИзМенюВариантовИсторииПоследних", ЭтотОбъект, ЭтаФорма);
	ЭтаФорма.ПоказатьВыборИзМеню(Оповещение, СписокИсторииПоследних, Элементы.ДекорацияВставитьИзИстории);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораИзМенюВариантовИсторииПоследних(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ДанныеПоИстории = Результат.Значение;
	
	НовСтрока = УчетРабочегоВремени.Добавить();
	ЗаполнитьЗначенияСвойств(НовСтрока, ДанныеПоИстории);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсториюПоследних()
	
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                |	ВложенныйЗапрос.ТипРаботы КАК ТипРаботы,
	                |	ВложенныйЗапрос.Затрачено КАК Затрачено,
	                |	ПОДСТРОКА(ВложенныйЗапрос.Комментарий, 1, 250) КАК Комментарий
	                |ИЗ
	                |	(ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 10
	                |		УчетРабочегоВремени.ТипРаботы КАК ТипРаботы,
	                |		УчетРабочегоВремени.Затрачено КАК Затрачено,
	                |		ПОДСТРОКА(УчетРабочегоВремени.Комментарий, 1, 250) КАК Комментарий,
	                |		УчетРабочегоВремени.День КАК День
	                |	ИЗ
	                |		РегистрСведений.УчетРабочегоВремени КАК УчетРабочегоВремени
	                |	ГДЕ
	                |		УчетРабочегоВремени.Исполнитель = &Исполнитель
	                |		И УчетРабочегоВремени.ШаблонПлановыхЗатрат = ЗНАЧЕНИЕ(Справочник.ШаблоныПлановыхТрудозатрат.ПустаяСсылка)
	                |	
	                |	УПОРЯДОЧИТЬ ПО
	                |		УчетРабочегоВремени.День УБЫВ) КАК ВложенныйЗапрос";
	 
	 Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	 
	 Результат = Запрос.Выполнить();
	 ТаблицаДанных = Результат.Выгрузить();
	 ИсторияПоследних.Загрузить(ТаблицаДанных);
 
	 Для каждого ТекСтрока Из ИсторияПоследних Цикл
		 
		  КомментарийДляВывода = ?(СтрДлина(ТекСтрока.Комментарий) < 15, ТекСтрока.Комментарий, Лев(ТекСтрока.Комментарий, 15) + "...");
		  КомментарийДляВывода = ?(ЗначениеЗаполнено(КомментарийДляВывода), СтрШаблон(НСтр("ru = ' - [%1]'"), КомментарийДляВывода), "");
		  
	 	  ТекСтрока.Представление = СтрШаблон(НСтр("ru = '%1 - %2%3'"), ТекСтрока.ТипРаботы, ТекСтрока.Затрачено, КомментарийДляВывода);
	 
	 КонецЦикла;
	
КонецПроцедуры 

#КонецОбласти
